coolt/sensortag/bicycle_computer_v3_27_April_not working_anymore/cc26xxware_2_22_00_16101/driverLib/flashsafe.h
//*****************************************************************************
//
//! \brief Programs unprotected main bank flash sectors.
//!
//! This function will program a sequence of bytes into the on-chip flash.
//! Programming each location consists of the result of an AND operation
//! of the new data and the existing data; in other words bits that contain
//! 1 can remain 1 or be changed to 0, but bits that are 0 cannot be changed
//! to 1.  Therefore, a byte can be programmed multiple times as long as these
//! rules are followed; if a program operation attempts to change a 0 bit to
//! a 1 bit, that bit will not have its value changed.
//!
//! This function will not return until the data has been programmed or an
//! programming error has occurred.
//!
//! \note Please note that code can not execute in flash while any part of the flash
//! is being programmed or erased. The actual programming function called by
//! this function must only be executed from ROM or SRAM.
//!
//! The \c pui8DataBuffer pointer can not point to flash.
//!
//! \param pui8DataBuffer is a pointer to the data to be programmed.
//! \param ui32Address is the starting address in flash to be programmed.
//! \param ui32Count is the number of bytes to be programmed.
//!
//! \return Returns status of flash sector program:
//! - \ref FAPI_STATUS_SUCCESS     : Success.
//! - \ref FAPI_STATUS_FSM_ERROR   : A programming error is encountered.
//! - \ref FLASHSAFE_ACCESS_DENIED : Flash is used by another thread.
//
//*****************************************************************************
extern uint32_t FlashsafeProgram(uint8_t *pui8DataBuffer, uint32_t ui32Address,
                                 uint32_t ui32Count);

//*****************************************************************************
//
//! \brief Disables all sectors for erase and programming on the active bank.
//!
//! This function disables all sectors for erase and programming on the active
//! bank and enables the Idle Reading Power reduction mode if no low power
//! mode is configured. Furthermore, an additional level of protection from
//! erase is enabled.
//!
//! \return Returns the status of the flash sector erase disable:
//! - \ref FLASHSAFE_ACCESS_DENIED : Flash is used by another thread.
//! - \ref FLASHSAFE_ACCESS_OK     : Successful.
//
//*****************************************************************************
extern uint32_t FlashsafeDisableSectorsForWrite(void);

//*****************************************************************************
//
// Support for DriverLib in ROM:
// Redirect to implementation in ROM when available.
//
//*****************************************************************************
#if !defined(DRIVERLIB_NOROM) && !defined(DOXYGEN)
    #include "../driverLib/rom.h"
    #ifdef ROM_FlashsafeSizeGet
        #undef  FlashsafeSizeGet
        #define FlashsafeSizeGet                ROM_FlashsafeSizeGet
    #endif
    #ifdef ROM_FlashsafeSectorSizeGet
        #undef  FlashsafeSectorSizeGet
        #define FlashsafeSectorSizeGet          ROM_FlashsafeSectorSizeGet
    #endif
    #ifdef ROM_FlashsafePowerModeSet
        #undef  FlashsafePowerModeSet
        #define FlashsafePowerModeSet           ROM_FlashsafePowerModeSet
    #endif
    #ifdef ROM_FlashsafePowerModeGet
        #undef  FlashsafePowerModeGet
        #define FlashsafePowerModeGet           ROM_FlashsafePowerModeGet
    #endif
    #ifdef ROM_FlashsafeProtectionSet
        #undef  FlashsafeProtectionSet
        #define FlashsafeProtectionSet          ROM_FlashsafeProtectionSet
    #endif
    #ifdef ROM_FlashsafeProtectionGet
        #undef  FlashsafeProtectionGet
        #define FlashsafeProtectionGet          ROM_FlashsafeProtectionGet
    #endif
    #ifdef ROM_FlashsafeProtectionSave
        #undef  FlashsafeProtectionSave
        #define FlashsafeProtectionSave         ROM_FlashsafeProtectionSave
    #endif
    #ifdef ROM_FlashsafeCheckFsmForError
        #undef  FlashsafeCheckFsmForError
        #define FlashsafeCheckFsmForError       ROM_FlashsafeCheckFsmForError
    #endif
    #ifdef ROM_FlashsafeCheckFsmForReady
        #undef  FlashsafeCheckFsmForReady
        #define FlashsafeCheckFsmForReady       ROM_FlashsafeCheckFsmForReady
    #endif
    #ifdef ROM_FlashsafeIntRegister
        #undef  FlashsafeIntRegister
        #define FlashsafeIntRegister            ROM_FlashsafeIntRegister
    #endif
    #ifdef ROM_FlashsafeIntUnregister
        #undef  FlashsafeIntUnregister
        #define FlashsafeIntUnregister          ROM_FlashsafeIntUnregister
    #endif
    #ifdef ROM_FlashsafeIntEnable
        #undef  FlashsafeIntEnable
        #define FlashsafeIntEnable              ROM_FlashsafeIntEnable
    #endif
    #ifdef ROM_FlashsafeIntDisable
        #undef  FlashsafeIntDisable
        #define FlashsafeIntDisable             ROM_FlashsafeIntDisable
    #endif
    #ifdef ROM_FlashsafeIntStatus
        #undef  FlashsafeIntStatus
        #define FlashsafeIntStatus              ROM_FlashsafeIntStatus
    #endif
    #ifdef ROM_FlashsafeIntClear
        #undef  FlashsafeIntClear
        #define FlashsafeIntClear               ROM_FlashsafeIntClear
    #endif
    #ifdef ROM_FlashsafeSectorErase
        #undef  FlashsafeSectorErase
        #define FlashsafeSectorErase            ROM_FlashsafeSectorErase
    #endif
    #ifdef ROM_FlashsafeProgram
        #undef  FlashsafeProgram
        #define FlashsafeProgram                ROM_FlashsafeProgram
    #endif
    #ifdef ROM_FlashsafeDisableSectorsForWrite
        #undef  FlashsafeDisableSectorsForWrite
        #define FlashsafeDisableSectorsForWrite ROM_FlashsafeDisableSectorsForWrite
    #endif
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // __FLASHSAFE_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//! @}
//
//*****************************************************************************
